APC10x4.5Static/1750RPM/Allrun
#!/bin/sh
cd "${0%/*}" || exit                                # Run from this directory
. ${WM_PROJECT_DIR:?}/bin/tools/RunFunctions        # Tutorial run functions
#------------------------------------------------------------------------------

mapFields -consistent -sourceTime "latestTime" -parallelSource -parallelTarget ../1750HubTestPre/

runApplication pyFoamPlotRunner.py mpirun -np 6 $(getApplication) -parallel

runApplication reconstructPar

paraFoam
#------------------------------------------------------------------------------
